import React from "react";
import "./detail.css";
export default function Detail() {
  return (
    <div className="Dcontaoner">
      <div className="tip">
        <h2>การเต้นแอโรบิก</h2>
        <p>
          เป็นกิจกรรมการออกกำลังกายที่ดัดแปลงและปรับปรุงใหม่ โดยชาวอเมริกัน ชื่อ
          ๋Jackie Soreson ในปีค.ศ. 1979 โดยเข้ามาในไทยเมื่อปีพ.ศ. 2522
          โดยสถานบริหารร่างกายเวิลด์คลับ การเต้นแอโรบิค
          ร่างกายต้องใช้ออกซิเจนจำนวนมากและสม่ำเสมอ
          โดยการเต้นแอโรบิคจะเป็นการออกกำลังกายโดยนำท่ากายบริหาร การเต้นรำ
          การเคลื่อนไหวพื้นฐาน เช่น เดิน วิ่ง กระโดด
          มาผสมผสานกันเป็นท่าชุดเต้นไปตามจังหวะเพลง
          ซึ่งเพลงที่ใช้จะต้องมีจังหวะเร็วสนุก เช่น เพลงดิสโก้ เป็นต้น
          ประโยชน์ที่ได้รับจากการออกกำลังกายโดยการเต้นแอโรบิคมีหลายประการด้วยกัน
          คือ ช่วยสร้างความอดทนของระบบไหลเวียนโลหิต
          ทำให้ร่างกายมีความอดทนมากขึ้น เหนื่อยช้าลง ทำให้รูปร่างและทรวดทรงดี
          สนุกสนานร่าเริง หายจากความตึงเครียด
          ช่วยสร้างความแข็งแรงและความอดทนของกล้ามเนื้อ
          และยังทำให้ร่างกายมีความอ่อนตัวดีมากขึ้น
        </p>
      </div>
      <div className="tip">
        <h2>ประเภทของการเต้นแอโรบิค</h2>
        <p>
          1.แบ่งตามแรงกระแทก - การเต้นแบบย่อยืดขา โดยไม่มีการยกหรือกระโดด
          เหมาะกับผู้ที่มีปัญหาทางสุขภาพและผู้สูงอายุ -
          การเต้นที่มักจะให้มีขาข้างหนึ่งติดพื้นเสมอซึ่งจะลดการกระแทก
          เน้นการใช้ร่างกายส่วนบนมากขึ้น เหมาะกับทุกเพศทุกวัย -
          การเต้นซึ่งมีการกระแทกของเท้าต่อพื้นอย่างรุนแรง
          ไม่เหมาะกับผู้ที่มีสมรรถภาพร่างกายไม่ดีพอ ปัจจุบันไม่นิยมเต้นกัน -
          การเต้นที่ผสมระหว่างการเต้นแบบย่อยืดขาและการเต้นซึ่งมีการกระแทกของเท้าต่อพื้นอย่างแรง
          มีการวิ่งกระโดดขย่ม เหมาะสำหรับผู้ที่มีร่างกายแข็งแรงและวัยหนุ่มสาว
        </p>
        <p>
          2.แบ่งตามลักษณะของผู้เต้น - ผู้ที่ไม่เคยเต้นแอโรบิคมาก่อน
          การฝึกเป็นการฝึกเทคนิคการเคลื่อนไหวร่างกายพื้นฐาน
          มีการฝึกระบบประสาทและกล้ามเนื้อบ้าง เพลงช้าใช้เวลาประมาณ 30 นาที
          ความหนักของการเต้นประมาณ 60% ของชีพจรสูงสุด -
          ทำการเปลี่ยนท่าทางต่างๆได้อย่างราบรื่นและซับซ้อนมากชึ้น เล่นนานขึ้น
          เร็วขึ้น เหมาะสำหรับผู้ที่มีสุขภาพแข็งแรง และออกกำลังกายเป็นประจำ
          ใช้เวลาประมาณ 45นาที ความหนักของการเต้น 70 % ของชีพจรสูงสุด -
          ขั้นผู้มีความชำนาญและมีประสบการณ์ มีความยากและซับซ้อน
          ใช้เวลาในการเล่นครั้งละ 45-60 นาที ความหนักของการเต้นประมาณ 80-90%
          ของชีพจรสูงสุด
        </p>
      </div>

      <div className="tip">
        <h2>ขั้นตอนในการฝึกเต้นแอโรบิค </h2>
        <p>
          1.ช่วงเตรียมความพร้อม ประกอบด้วย
          การบริหารข้อต่อสัดส่วนต่างๆของร่างกายและการยืดกล้ามเนื้อในช่วงนี้ควรจะมีชีพจรเต้นอยู่ระหว่าง
          100 ครั้งต่อนาที ใช้เวลาประมาณ 5-10 นาที
        </p>
        <p>
          2.ช่วงแอโรบิค จำเป็นต้องแบ่งความหนักเบาของกิจกรรม
          ทั้งนี้ขึ้นอยู่กับสมรรถภาพของผู้เข้าร่วมจะใช้เวลาประมาณ 30 นาที
          ชีพจรขณะเต้น ประมาณ 60-80%
          ของชีพจรสูงสุดและจะต้องคำนึงถึงลักษณะและชนิดของการเคลื่อนไหวเป็นหลัก
          คือให้ทุกส่วนของร่างกายได้เคลื่อนไหวอย่างต่อเนื่อง
        </p>
        <p>
          3.ช่วงผ่อนคลายกล้ามเนื้อ
          เป็นการบริหารกายเฉพาะส่วนและเป็นการยืดเหยียดกล้ามเนื้อ
          โดยเน้นที่การยืดเหยียดกล้ามเนื้ออย่างช้าๆ เพื่อเข้าสู่ภาวะปกติ
          การผ่อนคลายจะหยุดค้างในท่านั้นๆประมาณ 5-20 วินาที ส่วนชีพจรควรต่ำกว่า
          100 ครั้งต่อนาที
        </p>
      </div>
    </div>
  );
}
