import { useState } from "react";
import "./App.css";

function Tabs() {
  const [toggleState, setToggleState] = useState(1);

  const toggleTab = (index) => {
    setToggleState(index);
  };

  return (
    <div className="container">
      <div className="bloc-tabs">
        <button
          className={toggleState === 1 ? "tabs active-tabs" : "tabs"}
          onClick={() => toggleTab(1)}
        >
          ยืดกล้ามเนื้อก่อนออก
        </button>
        <button
          className={toggleState === 2 ? "tabs active-tabs" : "tabs"}
          onClick={() => toggleTab(2)}
        >
          จำนวนการออก
        </button>
        <button
          className={toggleState === 3 ? "tabs active-tabs" : "tabs"}
          onClick={() => toggleTab(3)}
        >
          ยืดกล้ามเนื้อหลังออก
        </button>
      </div>

      <div className="content-tabs">
        <div
          className={toggleState === 1 ? "content  active-content" : "content"}
        >
          <div className="textcontaner">
            <div className="text">
              <h2>1. กล้ามเนื้อคอด้านหลัง (Neck extensor muscle)</h2>
              <p>
                เอามือประสานท้ายทอย ก้มศีรษะลง ออกแรงกดเบาๆ
                รู้สึกตึงเล็กน้อยบริเวณต้นคอด้านหลัง ยืดค้างไว้ 15-30 วินาที
                แล้วพัก ทำซ้ำ 5-10 ครั้ง
              </p>
            </div>

            <div className="text">
              <h2>
                2. กล้ามเนื้อคอด้านข้าง (Neck rotator, Neck lateral flexor)
              </h2>
              <p>
                เอามือจับศีรษะด้านข้าง เอียงศีรษะไปด้านข้าง ใช้มือกดยืดเบาๆ
                (ข้างเดียวกับมือ) รู้สึกตึงบริเวณกล้ามเนื้อคอด้านข้าง ทำทั้ง 2
                ข้าง ยืดค้างไว้ 15-30 วินาที แล้วพัก ทำซ้ำ 5-10 ครั้ง
              </p>
            </div>

            <div className="text">
              <h2>3. กล้ามเนื้สะบักด้านใน (Subscapularis mucle)</h2>

              <p>
                ยกแขนขึ้นเหนือศีรษะพับข้อศอกลง มือแตะไหล่ฝั่งตรงข้าม
                ใช้มือดึงข้อศอกไปยังฝั่งตรงข้าม
                รู้สึกตึงบริเวณกล้ามเนื้อสะบักเล็กน้อย ทำทั้ง 2 ข้าง ยืดค้างไว้
                15-30 วินาที แล้วพัก ทำซ้ำ 5-10 ครั้ง
              </p>
            </div>

            <div className="text">
              <h2>4.กล้ามเนื้อหลังส่วนล่าง (Lower back muscle)</h2>

              <p>
                นอนราบบนเสื่อ จากนั้นงอเข่า ใช้มือกอดใต้เข่าทั้ง 2 ข้าง
                ดึงให้เข่าชิดอก ขณะทำพยายามให้หลังติดพื้นตลอดเวลา ยืดค้างไว้
                15-30 วินาที แล้วพัก ทำซ้ำ 5-10 ครั้ง
              </p>
            </div>
          </div>
        </div>

        <div
          className={toggleState === 2 ? "content  active-content" : "content"}
        >
          <div className="textcontaner">
            <div className="text">
              <h2>Step 1 ท่าย่ำเท้าอยู่กับที่</h2>
              <img src="./test1.jpg" alt="" className="imgtest" />
              <p>
                วิธีทำ : ยืนตรง ยกมือเท้าเอว จากนั้นย่ำเท้าสลับซ้าย-ขวา
                ต่อเนื่องกันไปประมาณ 1-2 นาที
              </p>
            </div>

            <div className="text">
              <h2>Step 2 ท่าวาดมือขึ้น เท้าแตะข้าง</h2>
              <img src="./test2.jpg" alt="" className="imgtest" />
              <p>
                วิธีทำ : ยืนตรง กางขาออกเล็กน้อย
                จากนั้นออกแรงยกมือขึ้นเหนือศีรษะ
                ระหว่างยกมือขึ้นให้เตะขาซ้ายออกไปด้านข้าง ปลายเท้าแตะพื้น
                ลดมือลงพร้อมกับดึงขากลับมาสู่ท่าเริ่มต้น จากนั้นสลับข้าง
              </p>
            </div>

            <div className="text">
              <h2>Step 3 ท่าโบกแท็กซี่</h2>
              <img src="./test3.jpg" alt="" className="imgtest" />
              <p>
                วิธีทำ : ยกมือขึ้นเหนือศีรษะ จากนั้นก็โบกไปมาตามจังหวะของเพลง
                สามารถเปิดเพลงที่มีจังหวะเร็วเพื่อสร้างความสนุกสนานได้ตามใจชอบ
              </p>
            </div>

            <div className="text">
              <h2>Step 4 กางศอก หุบศอก</h2>
              <img src="./test4.jpg" alt="" className="imgtest" />
              <p>
                วิธีทำ : ยืนตรง จากนั้นยกแขนขึ้นตั้งฉากกับลำตัว ตั้งข้อศอกงอ
                จากนั้นหุบศอกเข้าหากันและกางออก ทำเป็นจังหวะช้าๆ ตามเพลง
              </p>
            </div>
            <div className="text">
              <h2>Step 5 เท้าเอว หมุนไหล่</h2>
              <img src="./test5.jpg" alt="" className="imgtest" />

              <p>
                วิธีทำ : ยืนตรง แยกขาออกจากกันเล็กน้อย
                นำมือทั้งสองข้างเท้าเอวและหมุนไหล่ไปทางด้านหน้าเบาๆ
                จากนั้นก็หมุนกลับไปด้านหลัง ท่านี้ได้บริหารไหล่
                ช่วยทำให้หัวไหล่สบาย คลายปวดเมื่อยได้ดีสำหรับผู้สูงอายุ
              </p>
            </div>
            <div className="text">
              <h2>Step 6 บริหารลำตัว</h2>
              <img src="./test6.jpg" alt="" className="imgtest" />

              <p>
                วิธีทำ : ยืนตรง ยกมือเท้าเอว จากนั้นบิดลำตัวไปทางซ็ายช้าๆ จนสุด
                แล้วบิดตัวกลับมาทางขวา สลับกันไปมาประมาณ 15 ครั้ง
              </p>
            </div>
            <div className="text">
              <h2>Step 7 แกว่งแขน</h2>
              <img src="./test7.jpg" alt="" className="imgtest" />

              <p>
                วิธีทำ : เคล็ดลับท่าออกกำลังผู้สูงอายุท่านี้ก็คือ
                ต้องแกว่งไปข้างหน้าเบาๆ แต่แกว่งกลับไปด้านหลังให้แรงกว่า
                ทำซ้ำประมาณ 10 นาทีในช่วงแรก
                แล้วค่อยเพิ่มเวลาหรือทำท่าออกกำลังกายอื่นๆ
                ที่เรานำมาฝากกันก็ได้ค่ะ ช่วยลดพุง ลดความดันโลหิต คลายความเครียด
                แถมรักษาโรคได้เพียบ!
              </p>
            </div>
          </div>
        </div>

        <div
          className={toggleState === 3 ? "content  active-content" : "content"}
        >
          <div className="textcontaner">
            <div className="text">
              <h2>1. ยืดเหยียดกล้ามเนื้อคอด้านข้าง</h2>
              <p>
                เอียงศีรษะไปด้านในด้านหนึ่งและใช้มือข้างเดียวกันเหนี่ยวศีรษะด้านนั้นลง
                ทำสลับกันซ้าย-ขวาทำซ้ำอย่างน้อย 2-3 ครั้ง
                และควรนิ่งค้างไว้ในตำแหน่งที่รู้สึกตึงประมาณ 10-15 วินาที
              </p>
            </div>

            <div className="text">
              <h2>2. ยืดเหยียดกล้ามเนื้อหัวไหล่ด้านหน้าและหน้าอก</h2>
              <p>
                ประสานมือไว้ด้านหลังในระดับเอว ตั้งลำตัวให้ตรงและยกแขนขึ้นช้าๆ
                ให้ได้มากที่สุดทำซ้ำอย่างน้อย 2-3 ครั้ง
                และควรนิ่งค้างไว้ในตำแหน่งที่รู้สึกตึงประมาณ 10-15 วินาที
              </p>
            </div>

            <div className="text">
              <h2>3. ยืดเหยียดกล้ามเนื้อน่อง ต้นขาด้านหลัง สะโพก และหลัง</h2>

              <p>
                ยืนแยกเท้าเล็กน้อย ประสานมือกันในระดับไหล่
                ก้มศีรษะลงและจัดท่าให้แขนอยู่แนบข้างใบหู
                แล้วก้มตัวไปข้างหน้าให้มากที่สุดโดยให้ลำตัวขนานกับพื้นทำซ้ำอย่างน้อย
                2-3 ครั้ง และควรนิ่งค้างไว้ในตำแหน่งที่รู้สึกตึงประมาณ 10-15
                วินาที
              </p>
            </div>

            <div className="text">
              <h2>4. ยืดเหยียดกล้ามเนื้อน่องและต้นขาด้านหลัง</h2>

              <p>
                นั่งเหยียดขาข้างหนึ่งราบกับพื้น ส่วนอีกข้างงอไว้
                แล้วก้มตัวลงไปข้างหน้าขณะที่ปลายเท้ากระดกขึ้น
                ควรก้มลงในลักษณะลำตัวตรง
                ไม่เอียงหรือตะแคงไปข้างใดข้างหนึ่งซ้ำอย่างน้อย 2-3 ครั้ง
                และควรนิ่งค้างไว้ในตำแหน่งที่รู้สึกตึงประมาณ 10-15 วินาที
              </p>
            </div>
          </div>
        </div>
      </div>
    </div>
  );
}

export default Tabs;
