import React from "react";
import "./faq.css";
export default function Faq() {
  return (
    <div className="faqcon" id="faq">
      <h2>คำถามเกี่ยวกับการออกกำลังกาย</h2>
      <div className="textdescsa">
        <h3>1. ต้องซีเรียสยืดหยุ่นร่างกายทุกครั้งไหม?</h3>
        <p>
          จากการศึกษา 12 งานวิจัยระบุว่า
          การยืดหยุ่นร่างกายอาจไม่ได้ช่วยลดอาการปวดกล้ามเนื้อ
          ไม่ช่วยลดภาวะบาดเจ็บของหลังและขา
          แต่การยืดหยุ่นร่างกายมีส่วนช่วยลดการบาดเจ็บบริเวณข้อต่อและเส้นเอ็น
          ยิ่งเป็นประโยชน์ขึ้นหากคุณยืดหยุ่นร่างกายแบบ Dynamic Stretching
          (การยืดกล้ามเนื้อแบบเคลื่อนไหว) “ควรทำอยู่ดี”
        </p>
      </div>
      <div className="textdescsa">
        <h3>2. ออกกำลังกาย จำเป็นต้องเสียเหงื่อมากๆ ไหม?</h3>
        <p>
          แต่เหงื่ออาจอำพรางอะไรบางอย่างไว้ นักวิจัย Stuart Phillips
          จากมหาวิทยาลัย McMaster University แนะนำว่า
          เหงื่อไม่ใช่คุณประโยชน์ที่แท้จริงของการออกกำลังกาย
          ร่างกายของคุณพยายามจัดการกับความร้อนต่างหาก
          เหงื่อจึงออกเพื่อลดความร้อนของร่างกาย นั่นเองทำให้คนนั่งซาวน่าร้อนๆ
          แล้วเผลอคิดไปว่าได้ผลลัพธ์ใกล้เคียงกับการออกกำลังกาย
          ซึ่งมันไม่เท่ากัน“ไม่จำเป็นเสมอไป”
        </p>
      </div>
      <div className="textdescsa">
        <h3>3. วิ่งบนลู่ดีเท่ากับวิ่งในสวนหรือไม่?</h3>
        <p>
          แต่นักวิจัยอย่าง Irene Davis จากมหาวิทยาลัย Harvard Medical School
          สำรวจพบว่า
          คนที่วิ่งบนลู่ส่วนใหญ่มักวิ่งด้วยการตั้งความเร็วตั้งไว้คงที่
          ทำให้มันสูญเสียธรรมชาติของร่างกายที่จังหวะฝีเท้าปรับตามความเหนื่อล้า
          อีกอย่างของการวิ่งลู่ก็ยังขาดทัศนวิสัยในการมอง
          เพราะคุณจะจับจ้องกับกำแพงอันเดียว“แล้วแต่รสนิยมและความสะดวก”
        </p>
      </div>
      <div className="textdescsa">
        <h3>4. ควรออกกำลังกายตอนท้องว่างไหม?</h3>
        <p>
          นักวิจัย Dylan Thompson จากมหาวิทยาลัย Bath
          ทดลองให้คนที่มีน้ำหนักมากวิ่งบนลู่ขณะท้องว่าง
          และอีกกลุ่มหนึ่งที่วิ่งหลังจากทานอาหารเช้ามาแล้ว
          จากนั้นทีมวิจัยจะตรวจเนื้อเยื่อไขมันพบว่า
          กลุ่มที่วิ่งขณะท้องว่างมีสัดส่วนการใช้ไขมันเป็นพลังงานมากกว่ากลุ่มที่ทานอาหารมา“ขึ้นอยู่กับโปรแกรมของคุณ”
        </p>
      </div>
    </div>
  );
}
